---
kind: enumMember
id: F:Autodesk.Revit.DB.PathType.Server
enum: Autodesk.Revit.DB.PathType
source: html/dab91714-40d3-bc4a-6c5e-1b5eb504e341.htm
---
# Autodesk.Revit.DB.PathType.Server

The path is to a Revit Server location. This value is only
 valid for ExternalFileReferenceType.RevitLink.